using PolyLabelNet48;
using ScottPlot;
using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows.Forms;

namespace WinApp
{
    public partial class Form1 : Form
    {
        private ScottPlot.WinForms.FormsPlot _formsPlot;

        public Form1()
        {
            InitializeComponent();

            btnRun.Click += Run_Click;

            InitPlot();
        }

        private void InitPlot()
        {
            // 在 Form1 的构造函数或 Load 事件中
            _formsPlot = new ScottPlot.WinForms.FormsPlot() { Dock = DockStyle.Fill };
            panelView.Controls.Add(_formsPlot); // panel1 为界面上的占位符

            // create floating X and Y axes using one of the existing axes for reference
            ScottPlot.Plottables.FloatingAxis floatingX = new ScottPlot.Plottables.FloatingAxis(_formsPlot.Plot.Axes.Bottom);
            ScottPlot.Plottables.FloatingAxis floatingY = new ScottPlot.Plottables.FloatingAxis(_formsPlot.Plot.Axes.Left);

            // hide the default axes and add the custom ones to the plot
            _formsPlot.Plot.Axes.Frameless();
            // _formsPlot.Plot.HideGrid();
            _formsPlot.Plot.Add.Plottable(floatingX);
            _formsPlot.Plot.Add.Plottable(floatingY);


            // var rect1 = _formsPlot.Plot.Add.Rectangle(0, 1, 0, 1);
            // var rect2 = _formsPlot.Plot.Add.Rectangle(1, 2, 0, 1);


            var rect1 = CoordinateRect.UnitSquare.WithTranslation(0, 0);
            var rect2 = CoordinateRect.UnitSquare.WithTranslation(1, 0);
            _formsPlot.Plot.Add.Rectangle(rect1);
            _formsPlot.Plot.Add.Rectangle(rect2);


            // // 绘制示例
            // _formsPlot.Plot.Add.Signal(new double[] { 1, 2, 8, 4, 5 });

            // //==================================================
            // _crosshair = _formsPlot.Plot.Add.Crosshair(0, 0);
            // _crosshair.IsVisible = false;
            // _crosshair.MarkerShape = MarkerShape.OpenCircle;
            // _crosshair.MarkerSize = 10;
            // 
            // _scatter = null;

            _formsPlot.Plot.Axes.SquareUnits();
            _formsPlot.Plot.Axes.AutoScale();
            _formsPlot.Refresh();

            // _formsPlot.MouseMove += _formsPlot_MouseMove;
        }

        private void InitPlot(List<PolyLabelNet48.Models.Point> points, PolyLabelNet48.Models.PolylabelResult result)
        {
            // // 在 Form1 的构造函数或 Load 事件中
            // _formsPlot = new ScottPlot.WinForms.FormsPlot() { Dock = DockStyle.Fill };
            // panelView.Controls.Add(_formsPlot); // panel1 为界面上的占位符

            _formsPlot.Plot.Clear();

            // create floating X and Y axes using one of the existing axes for reference
            ScottPlot.Plottables.FloatingAxis floatingX = new ScottPlot.Plottables.FloatingAxis(_formsPlot.Plot.Axes.Bottom);
            ScottPlot.Plottables.FloatingAxis floatingY = new ScottPlot.Plottables.FloatingAxis(_formsPlot.Plot.Axes.Left);

            // hide the default axes and add the custom ones to the plot
            _formsPlot.Plot.Axes.Frameless();
            // _formsPlot.Plot.HideGrid();
            _formsPlot.Plot.Add.Plottable(floatingX);
            _formsPlot.Plot.Add.Plottable(floatingY);

            var coords = points.Select(o => new Coordinates(o.X, o.Y)).ToArray();
            _formsPlot.Plot.Add.Scatter(coords);

            var center = new Coordinates(result.Point.X, result.Point.Y);
            _formsPlot.Plot.Add.Circle(center, result.Distance);


            // // 绘制示例
            // _formsPlot.Plot.Add.Signal(new double[] { 1, 2, 8, 4, 5 });

            // //==================================================
            // _crosshair = _formsPlot.Plot.Add.Crosshair(0, 0);
            // _crosshair.IsVisible = false;
            // _crosshair.MarkerShape = MarkerShape.OpenCircle;
            // _crosshair.MarkerSize = 10;
            // 
            // _scatter = null;

            _formsPlot.Plot.Axes.SquareUnits();
            _formsPlot.Plot.Axes.AutoScale();
            _formsPlot.Refresh();

            // _formsPlot.MouseMove += _formsPlot_MouseMove;
        }

        private void Test01()
        {
            var str = "[23528,7614][22750,6877][22847,6760][22900,6695][22950,6630][22996,6565][23044,6495][23085,6430][23121,6368][23153,6308][23182,6250][23208,6191][23232,6132][23253,6073][23273,6012][23290,5950][23304,5887][23316,5824][23326,5760][23334,5695][23339,5631][23342,5567][23342,5503][23340,5438][23335,5375][23328,5312][23318,5250][23307,5189][23293,5129][23276,5070][23258,5013][23237,4956][23214,4901][23189,4848][23161,4792][23126,4730][23063,4626][23063,4626][23020,4556][22979,4494][22943,4442][22906,4394][22867,4347][22827,4302][22784,4259][22740,4217][22695,4177][22648,4140][22598,4103][22545,4067][22490,4032][22433,4000][22374,3968][22313,3939][22252,3912][22188,3887][22123,3864][22057,3843][21991,3825][21924,3809][21858,3796][21790,3784][21724,3776][21657,3770][21592,3767][21527,3765][21462,3767][21399,3771][21330,3777][21249,3788][21153,3803][21064,3819][20915,3848][20640,2804][20881,2738][20981,2714][21064,2696][21147,2681][21229,2668][21309,2658][21386,2651][21463,2646][21544,2644][21625,2644][21703,2646][21784,2651][21870,2659][21956,2669][22043,2681][22127,2696][22209,2713][22290,2732][22369,2753][22446,2776][22522,2801][22595,2828][22666,2857][22735,2887][22801,2919][22869,2954][22943,2996][23023,3043][23105,3095][23191,3153][23269,3208][23334,3256][23394,3304][23455,3355][23515,3410][23574,3466][23630,3523][23683,3581][23735,3640][23785,3702][23835,3767][23885,3836][23939,3917][23995,4003][24028,4055][24028,4055][24105,4187][24148,4265][24187,4341][24222,4415][24254,4488][24284,4561][24312,4636][24337,4712][24359,4787][24380,4865][24399,4946][24417,5031][24431,5115][24444,5200][24454,5285][24461,5371][24466,5454][24469,5538][24469,5621][24467,5703][24462,5785][24455,5865][24445,5943][24434,6019][24420,6095][24404,6169][24385,6241][24365,6313][24342,6384][24316,6456][24287,6529][24254,6606][24216,6688][24173,6775][24129,6859][24085,6936][24043,7007][24002,7071][23960,7131][23915,7192][23866,7254][23813,7316][23758,7379][23690,7451][23528,7614]";
            // var str = "[15225,13678][14292,13152][14358,13015][14394,12938][14426,12864][14456,12790][14485,12710][14509,12638][14529,12568][14546,12503][14560,12439][14571,12376][14580,12313][14586,12250][14590,12186][14591,12122][14591,12058][14587,11993][14581,11928][14573,11864][14562,11801][14549,11738][14534,11675][14516,11613][14496,11553][14474,11493][14450,11436][14424,11379][14396,11325][14366,11272][14334,11220][14300,11171][14265,11122][14228,11077][14186,11029][14138,10978][14051,10892][14051,10892][13993,10835][13938,10784][13891,10743][13843,10705][13794,10669][13743,10635][13692,10603][13639,10573][13585,10546][13531,10521][13474,10497][13414,10475][13351,10455][13288,10437][13224,10421][13158,10407][13091,10396][13024,10387][12955,10380][12886,10376][12817,10374][12749,10375][12681,10378][12613,10383][12546,10391][12480,10402][12416,10414][12353,10429][12290,10446][12230,10465][12164,10488][12089,10517][11999,10556][11917,10593][11779,10657][11260,9710][11478,9588][11569,9541][11645,9503][11721,9468][11798,9436][11873,9407][11946,9382][12020,9358][12098,9336][12176,9316][12253,9300][12333,9285][12417,9272][12504,9261][12591,9252][12676,9246][12760,9242][12843,9241][12924,9243][13006,9246][13085,9252][13162,9261][13239,9271][13313,9284][13385,9299][13459,9317][13541,9339][13629,9366][13721,9397][13819,9432][13908,9466][13983,9497][14053,9529][14124,9564][14196,9603][14267,9643][14335,9685][14400,9728][14465,9773][14529,9821][14593,9872][14658,9927][14730,9992][14805,10062][14849,10105][14849,10105][14956,10214][15017,10279][15073,10344][15125,10407][15174,10470][15220,10534][15265,10600][15308,10667][15348,10735][15387,10805][15425,10880][15463,10957][15497,11036][15530,11115][15560,11195][15588,11276][15613,11356][15636,11437][15656,11517][15674,11598][15689,11678][15701,11758][15711,11835][15718,11912][15723,11989][15725,12065][15725,12139][15723,12214][15718,12288][15710,12364][15699,12442][15686,12525][15669,12614][15648,12709][15625,12801][15602,12886][15578,12965][15554,13037][15528,13106][15499,13176][15466,13248][15430,13321][15391,13395][15343,13481][15225,13678]";
            // var str = "15225,13678][14292,13152][14358,13015][14394,12938][14426,12864][14456,12790][14485,12710][14509,12638][14529,12568][14546,12503][14560,12439][14571,12376][14580,12313][14586,12250][14590,12186][14591,12122][14591,12058][14587,11993][14581,11928][14573,11864][14562,11801][14549,11738][14534,11675][14516,11613][14496,11553][14474,11493][14450,11436][14424,11379][14396,11325][14366,11272][14334,11220][14300,11171][14265,11122][14228,11077][14186,11029][14138,10978][14051,10892][14051,10892][13993,10835][13938,10784][13891,10743][13843,10705][13794,10669][13743,10635][13692,10603][13639,10573][13585,10546][13531,10521][13474,10497][13414,10475][13351,10455][13288,10437][13224,10421][13158,10407][13091,10396][13024,10387][12955,10380][12886,10376][12817,10374][12749,10375][12681,10378][12613,10383][12546,10391][12480,10402][12416,10414][12353,10429][12290,10446][12230,10465][12164,10488][12089,10517][11999,10556][11917,10593][11779,10657][11260,9710][11478,9588][11569,9541][11645,9503][11721,9468][11798,9436][11873,9407][11946,9382][12020,9358][12098,9336][12176,9316][12253,9300][12333,9285][12417,9272][12504,9261][12591,9252][12676,9246][12760,9242][12843,9241][12924,9243][13006,9246][13085,9252][13162,9261][13239,9271][13313,9284][13385,9299][13459,9317][13541,9339][13629,9366][13721,9397][13819,9432][13908,9466][13983,9497][14053,9529][14124,9564][14196,9603][14267,9643][14335,9685][14400,9728][14465,9773][14529,9821][14593,9872][14658,9927][14730,9992][14805,10062][14849,10105][14849,10105][14956,10214][15017,10279][15073,10344][15125,10407][15174,10470][15220,10534][15265,10600][15308,10667][15348,10735][15387,10805][15425,10880][15463,10957][15497,11036][15530,11115][15560,11195][15588,11276][15613,11356][15636,11437][15656,11517][15674,11598][15689,11678][15701,11758][15711,11835][15718,11912][15723,11989][15725,12065][15725,12139][15723,12214][15718,12288][15710,12364][15699,12442][15686,12525][15669,12614][15648,12709][15625,12801][15602,12886][15578,12965][15554,13037][15528,13106][15499,13176][15466,13248][15430,13321][15391,13395][15343,13481][15225,13678";
            var start = str.IndexOf('[');
            var end = str.LastIndexOf(']');
            var tmp = str.Substring(start + 1, end - start - 1);
            var arr = tmp.Split(new[] { "][" }, StringSplitOptions.RemoveEmptyEntries);
            var list = new List<PolyLabelNet48.Models.Point>();
            foreach (var s in arr)
            {
                var arrPs = s.Split(new[] { "," }, StringSplitOptions.RemoveEmptyEntries);
                if (arrPs.Length == 2 && float.TryParse(arrPs[0], out var x) && float.TryParse(arrPs[1], out var y))
                {
                    list.Add(new PolyLabelNet48.Models.Point(x, y));
                }
            }

            // var coords = list.Select(o => new Coordinates(o.X, o.Y)).ToList();

            var polygon = new PolyLabelNet48.Models.Polygon(new PolyLabelNet48.Models.Point[][] { list.ToArray() });
            var res = Polylabel.Run(polygon, 1f, true);

            InitPlot(list, res);
        }

        private void Run_Click(object sender, EventArgs e)
        {
            Test01();


        }


        

    }
}
